# LeaderHasShoulder Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpotDimension..::..LeaderHasShoulder Property
SpotDimension Class See Also
---
True is dimension has leader with shoulder, false otherwise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public bool LeaderHasShoulder { get; set; }
```

Visual Basic
---
```text
Public Property LeaderHasShoulder As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool LeaderHasShoulder {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Dimension must have leader. -or- Thrown when: |

  * SpotDimension style type is SpotSlope.
  * Using equality formula.
  * Dimension style is ordinate.

-or- The dimension is a SpotSlope or has no leader.
# See Also
SpotDimension Class
Autodesk.Revit.DB Namespace